stress_tests/gunicorn_statics
Server Software:        gunicorn
Server Hostname:        127.0.0.1
Server Port:            8081

Document Path:          /static/img/warmaster.jpg
Document Length:        275375 bytes

Concurrency Level:      1
Time taken for tests:   2.446 seconds
Complete requests:      1000
Failed requests:        665
   (Connect: 0, Receive: 0, Length: 665, Exceptions: 0)
Non-2xx responses:      665
Total transferred:      95098750 bytes
HTML transferred:       94792255 bytes
Requests per second:    408.87 [#/sec] (mean)
Time per request:       2.446 [ms] (mean)
Time per request:       2.446 [ms] (mean, across all concurrent requests)
Transfer rate:          37972.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     1    2   1.2      3       7
Waiting:        0    2   1.3      3       7
Total:          1    2   1.2      3       7

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      3
  95%      4
  98%      4
  99%      5
 100%      7 (longest request)